In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('dados/dataset1.csv')

In [3]:
df.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

In [4]:
# Extraindo dados de uma coluna

In [5]:
df['first_name']

0       Miguel
1        Mikey
2        Yamil
3         Mark
4       Andrew
        ...
610    Russell
611      Paolo
612    Kendall
613        NaN
614    Sheanon
Name: first_name, Length: 615, dtype: object

In [9]:
df[['first_name', 'position']].head()

  first_name position
0     Miguel        M
1      Mikey        D
2      Yamil        M
3       Mark        D
4     Andrew        F

#### Refatorando para deixar o processo mais leg√≠vel

In [10]:
salarios_atletas = ['first_name', 'base_salary', 'club']

In [11]:
df[salarios_atletas].head()

  first_name  base_salary club
0     Miguel    1912500.0  ATL
1      Mikey      65625.0  ATL
2      Yamil     150000.0  ATL
3       Mark      99225.0  ATL
4     Andrew      65000.0  ATL